tests/fixtures/charges/ch_1DMyewIpafQncvOMYhZHHlxV.json

{
    "id": "ch_1DMyewIpafQncvOMYhZHHlxV",
    "object": "charge",
    "amount": 3900,
    "amount_refunded": 0,
    "application": null,
    "application_fee": null,
    "balance_transaction": "txn_1DMyewIpafQncvOMSlrAQjy4",
    "captured": true,
    "created": 1234567890,
    "currency": "eur",
    "customer": null,
    "description": null,
    "destination": null,
    "dispute": null,
    "failure_code": null,
    "failure_message": null,
    "fraud_details": {
    },
    "invoice": null,
    "livemode": false,
    "metadata": {
        "member_id": "123456",
        "program_id": "67890"
    },
    "on_behalf_of": null,
    "order": null,
    "outcome": {
        "network_status": "approved_by_network",
        "reason": null,
        "risk_level": "normal",
        "risk_score": 20,
        "seller_message": "Payment complete.",
        "type": "authorized"
    },
    "paid": true,
    "payment_intent": null,
    "receipt_email": "coucou@coucou.fr",
    "receipt_number": null,
    "refunded": false,
    "refunds": {
        "object": "list",
        "data": [

        ],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/charges/ch_1DMyewIpafQncvOMYhZHHlxV/refunds"
    },
    "review": null,
    "shipping": null,
    "source": {
        "id": "src_1DMyetIpafQncvOMTJjlwMyq",
        "object": "source",
        "amount": null,
        "card": {
            "exp_month": 12,
            "exp_year": 2022,
            "brand": "Visa",
            "country": "FR",
            "cvc_check": "pass",
            "fingerprint": "8J0hhCTs6oaAa1eE",
            "funding": "credit",
            "last4": "0003",
            "three_d_secure": "optional",
            "name": null,
            "address_line1_check": null,
            "address_zip_check": null,
            "tokenization_method": null,
            "dynamic_last4": null
        },
        "client_secret": "src_client_secret_DobsspAKjduP6VVzMBcBclKH",
        "created": 1234567890,
        "currency": null,
        "flow": "none",
        "livemode": false,
        "metadata": {
        },
        "owner": {
            "address": null,
            "email": null,
            "name": null,
            "phone": null,
            "verified_address": null,
            "verified_email": null,
            "verified_name": null,
            "verified_phone": null
        },
        "statement_descriptor": null,
        "status": "consumed",
        "type": "card",
        "usage": "reusable"
    },
    "source_transfer": null,
    "statement_descriptor": null,
    "status": "succeeded",
    "transfer_group": "my-transfer-group"
}
